Revit 2026 API

# LabelUtilsGetStructuralSectionShapeName Method

---

Gets the user-visible name for a StructuralSectionShape.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GetStructuralSectionShapeName(
	StructuralSectionShape shape
)
```
```vb
Public Shared Function GetStructuralSectionShapeName (
	shape As StructuralSectionShape
) As String
```
```cpp
public:
static String^ GetStructuralSectionShapeName(
	StructuralSectionShape shape
)
```
```fsharp
static member GetStructuralSectionShapeName :
        shape : StructuralSectionShape -> string
```

#### Parameters

shape StructuralSectionShape
     The StructuralSectionShape to get the user-visible name.

#### Return Value

String Returns the user-visible name for the StructuralSectionShape.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

The name is obtained in the current Revit language.

#### Reference

LabelUtils Class

Autodesk.Revit.DB Namespace